package day17.exam;
/*
 * 클래스 : 틀(자료형)
 * 색체 : 실체(메모리에 만들어진 것)
 * 멤버필드 : 객체마다 가지는 변수
 * 멤버 메서드 : 객체들이 사용할 수 있는 함수
 * 생성자 : 객체 생성시 호출되는 메서드(멤버필드 초기화)
 * this : static메서드를 제외한 모든 멤버 메서드의 0번째 매개변수
 * 			(메서드 입장에서 자신을 호출한 객체를 참조)
 * 접근제어자 : 멤버에 대한 접근을 제어하는 키워드
 * 			(private - 은닉 /public - 공통의)
 * 			(getter/setter를 통해 값을 입력하거나 출력할수있음)
 * static : 정적(1. 필드(동일한 클래스의 인스턴스들이 공유하는 값)
 * 			   (2. 메서드(static필드를 조작하는 기능)
 * final : 필드(상수화)
 * 		   메서드(오버라이딩 불가) / 3. 클래스(상속 불가)
 */
public class exam01 {

}
